app/controllers/items_controller.rb

INSERT INTO `items` (`name`, `content`, `genre_id`, `itemdetail_id`, `shippingdetail_id`, `shippingprefecture_id`, `shipping_day_id`, `price`, `user_id`, `created_at`, `updated_at`) VALUES ('vovo', 'vovo', 4, 3, 3, 2, 2, 4000, 5, '2020-09-08 03:47:50.292672', '2020-09-08 03:47:50.292672')
---
  def create
    # binding.pry
    @item = Item.new(item_params)
    if @item.save!

UPDATE `items` SET `items`.`updated_at` = '2020-09-08 03:47:50.303854' WHERE `items`.`id` = 1
---
  def update
    if @item.update(item_params)